Revit 2026 API

# RebarReinforcementData Class

---

class containing the id and the end of rebar on which the coupler stays

SystemObject Autodesk.Revit.DB.StructureReinforcementData Autodesk.Revit.DB.StructureRebarReinforcementData

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class RebarReinforcementData : ReinforcementData
```
```vb
Public Class RebarReinforcementData
	Inherits ReinforcementData
```
```cpp
public ref class RebarReinforcementData : public ReinforcementData
```
```fsharp
type RebarReinforcementData =
    class
        inherit ReinforcementData
    end
```

The RebarReinforcementData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | End | The end of the rebar. The end should be 0 or 1. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from ReinforcementData) |
|  | RebarId | The id of the Rebar |

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new instance of RebarReinforcementData, or  if the operation fails. |
|  | Dispose | (Inherited from ReinforcementData) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Structure Namespace